brew "assh"
brew "atuin"
brew "awk"
brew "bat"
brew "ctop"
brew "diff-so-fancy"
brew "dive"
brew "docker-clean"
brew "docker-compose"
brew "icu4c@77"
brew "dotnet"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "hadolint"
brew "htop"
brew "node"
brew "python@3.13"
brew "jupyterlab"
brew "keychain"
brew "lazydocker"
brew "libxml2"
brew "mas"
brew "mosh"
brew "nmap"
brew "pipx"
brew "pkgconf"
brew "python@3.11"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "ssh-copy-id"
brew "starship"
brew "storm"
brew "terminal-notifier"
brew "thefuck"
brew "tmux"
brew "tree"
brew "trivy"
brew "virtualenv"
brew "wget"
brew "wireshark"
brew "zoxide"
brew "zplug"
brew "zsh-async"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "kitty"
cask "macfuse"
cask "mambaforge"
cask "wireshark-chmodbpf"
mas "Microsoft Remote Desktop", id: 1295203466
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Windows App", id: 1295203466
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "batisteo.vscode-django"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donebd.vscode-keypromoter"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "eriklynd.json-tools"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hkumar6.r-check"
vscode "hkumar6.r-vscode-tools"
vscode "hridoy.r-development"
vscode "ikuyadeu.r-pack"
vscode "kaih2o.python-resource-monitor"
vscode "kevinrose.vsc-python-indent"
vscode "ldez.ignore-files"
vscode "mads-hartmann.bash-ide-vscode"
vscode "manabuishii.vscode-cwl"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikhail-arkhipov.r"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "nguyenngoclong.terminal-keeper"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "rdebugger.r-debugger"
vscode "reageyao.biosyntax"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "sbg-rabix.benten-cwl"
vscode "shaharkazaz.git-merger"
vscode "shakram02.bash-beautify"
vscode "syler.ignore"
vscode "tianyishi.rmarkdown"
vscode "tushortz.python-extended-snippets"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wholroyd.jinja"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "ziyasal.vscode-open-in-github"
